Repository: henyee/NBDYSJCT
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 麦格看着她不服输的目光，迟疑了一下，还是重新坐下。
en_us: Mag saw her perseverence, hesitated for a while, and sat back down.

source: 麦格看着她就着酒鬼花生，喝完了一整瓶的茅台酒，然后没事人一般淡定的打开了那瓶威士忌。
en_us: Mag watched her finish the whole bottle of Maotai with the drunkard peanuts and then open that bottle of whiskey calmly as if she wasn't affected.

source: 麦格看着她，有些嘲讽的笑了笑：“你说是就是？那我说你们教皇是被厨神选中的人，是我麦米餐厅圣子，让他来我餐厅上菜吧，好好干，他将成为下一任店长。”
en_us: Mag looked at him, and mockingly laughed. "Why should I believe your words? What if I say that your pope is the one chosen by the God of Cookery, and is the holy child of my Mamy Restaurant, so it's best for him to come and serve dishes in my restaurant, and he will be the next manager if he does the job well?"

source: 麦格看着她，笑着指了指她的嘴角，“有颗粥。”
en_us: Mag looked at her and smiled as he pointed to the corner of her lips. "Porridge."

source: 麦格看着小家伙眼中闪烁的微光，心中不禁有些触动。
en_us: Mag looked at the gleam glittering in the little one's eyes, and couldn't help feeling touched.

source: 麦格看着屋子里已经清点出来的三十多个亿的现金和钱票，有些感慨道。
en_us: Mag looked at the three billion worth of cash in the house that was being counted and lamented to himself.

source: 麦格看着希利，思索了一会，还是让开了门，道：“进来吧。”
en_us: Mag looked at Seely, and pondered for a moment before he opened the door, and said, "Come in."

source: 麦格看着情绪有点低落的艾米，心里却觉得暖暖的，有些感动。
en_us: Mag looked at Amy, who seemed a little dejected, and felt a warm feeling in his heart.

source: 麦格看着手中的银色戒指，上面刻着一串神秘的符文，触感冰凉，看不出什么蹊跷。
en_us: Mag looked at the silver ring in his hand. A line of mysterious runes was engraved on it. It felt cold to the touch. Nothing unusual could be seen.

source: 麦格看着晞。
en_us: Mag looked at Xi.

source: 麦格看着晞的虚拟屏，点点头道：“只要能够确定他的位置，封印阵法能够解决，如何将其重新封印也能想办法。
en_us: Mag looked at Xi's virtual screen and nodded. "As long as we can locate him, we can resolve it with the seal spell formation. We can also think of a solution to reseal it.

source: 麦格看着晞道：“我身上的气息可以留着，但前提是你帮忙隐藏安妮的气息，否则我无法保证下次在你赶到之前，还能收到它的魂魄。”
en_us: Mag said to Xi, "You can keep the aura on me, but the premise is you have to help conceal the aura on Annie. Otherwise, I can't promise you can still keep its soul after you arrive next there."

source: 麦格看着有些紧张的埃菲和玛拉，连忙笑着摇头道：“不要误会，我是说，我们可以导演一场戏，亲自去会会那个幕后黑手。当然，酒馆是不能烧的，酒窖也不能毁掉。”
en_us: Mag looked at the nervous Eiffie and Mala and quickly shook his head. He said with a smile, "Don;t misunderstand me. What I'm saying is we can put up a show to meet that mastermind. Of course, we can't burn the tavern or the cellar."

source: 麦格看着瘫在他怀里的埃菲，脖子有些僵硬，已经感受到了来自身后的冰冷杀气。
en_us: Mag looked at Eiffie, who was in his embrace, and his neck turned stiff. He could already feel the cold murderous intent from behind him.

source: 麦格看着目光猩红的兰克斯特，一边招架，一边用余光扫视着天空。
en_us: Mag looked at Rankster with his blood-red eyes and while he blocked the attacks, he glanced across the sky.

source: 麦格看着砧板上那布满裂纹的黄瓜，满意的点了点头，然后用刀将他们切成小段。
en_us: Mag nodded as he looked at the cracked cucumber on the shopping board. After that, he cut them into small pieces.

source: 麦格看着绿豆都能玩的兴致勃勃的三个小家伙，笑着摇了摇头，取了一个大盆，盛了半盆绿豆，然后直接加水开始浸泡。
en_us: Mag looked at the three little fellows who could have so much fun with mung beans, and smiled as he shook his head. He took out a big pot, and filled half of it with mung beans. After that, he added water into the pot to soak the beans.

source: 麦格看着艾米湛蓝色大眼睛扑闪扑闪的可爱模样，心里只剩下一个念头：“答应她！”
en_us: Mag looked int Amy's azure blue eyes blinking adorably at him and ther was only one thought in his head: "Say yes!"

source: 麦格看着艾米脸上一如初见时干净的笑容，眼里那份期待让他不忍拒绝，稍稍迟疑，还是拿起勺子舀了一勺黑不溜秋的炒饭喂到嘴里。
en_us: Mag looked at the pure smile on Amy's face. Seeing the expectations in her eyes, he simply couldn't reject her. After a brief hesitation, he still picked up the spoon and fed himself a mouthful of that black fried rice.

source: 麦格看着艾米，眉头微皱，又是很快舒展开来，他知道了，小家伙一定是收到了新的系统任务，而且肯定是和找可食用的蜗牛有关。
en_us: Mag looked at Amy with furrowed brows. Then, he quickly unfurrowed his brows. He got it. The little one must have received a new system's mission and it must be related to finding edible snails.

source: 麦格看着艾米，笑着道：“小米同学，那么今天就有我们来接待来酒馆的客人们了。”
en_us: Mag looked at Amy, and smilingly said, "Little Amy, let us serve the customers that come to the tavern today."

source: 麦格看着艾米，道：“今天，我们去逛城西的书坊吧，听说那里是诺兰大陆规模最大的书坊，大大小小的书店无数，只要用心去淘，什么书都能找到。”
en_us: Mag looked at Amy, and said, "Let's go to the book square in the west of the city today. I heard it's the biggest book square on the Norland Continent, with countless big and small bookshops. We can find any books if we look hard enough."

source: 麦格看着被圣光烤的龇牙咧嘴的梅兰特，同样眼皮狂跳了几下，看了眼醉意未散的伊琳娜，想着这会不会变成一场惨烈的医疗事故。
en_us: Mag watched as Merante was roasted in the Holy Light, and his eyelids twitched frantically. He glanced at Irina, who seemed rather drunk, and was worried if this would end up becoming medical malpractice.

source: 麦格看着那巨汉，微笑着问道：“是这样的吗？”
en_us: Mag looked at that big guy and smilingly asked, "Is it so?"

source: 麦格看着鲍里斯脸上的九宫格血痕，笑着摸了摸艾米的脑袋。
en_us: Mag saw the grid bloody scratches on Boris's face and patted Amy's head with a smile.

source: 麦格看着鼻子冻的通红，眉毛上都挂着冰霜的诺亚，笑着取出了一个还冒着热气的泥团和一个小盅。
en_us: Mag looked at Noah whose nose was red and eyebrows had icicles, and smilingly took out a steaming mud case and a small soup pot.

source: 麦格眼睛一亮。
en_us: Mag's eyes lit up.

source: 麦格眼睛一亮，兰克斯特似乎还存着一点意识，并未完全被控制。
en_us: Mag's eyes lit up. There seemed to be a little consciousness left in Rankster. He was not completely under control.

source: 麦格眼睛一亮，没有想到冰下竟然别有洞天。
en_us: Mag's eyes lit up. He didn't expect there would be a cave under the ice.

source: 麦格眼睛一亮，这高雅醇和的酒香，比起茅台或许差了点，但也足够令人惊讶。
en_us: Mag's eyes lit up. Such a mild and elegant fragrant might be incomparable to maotai but it was still shocking.

source: 麦格睁开眼睛，对上了有些忐忑的埃菲。
en_us: Mag opened his eyes and met with Eiffie's nervous gaze.

source: 麦格瞄了一眼伊琳娜，见她神态自若，稍稍放松，走到街口拦了一辆马车，直奔品酒大会会场。
en_us: Mag glanced at Irina. When he saw her calm expression, he felt slightly relieved. Mag went to the roadside to hail a horse-drawn carriage and went straight to the liquor tasting event.

source: 麦格瞄了一眼被以龟甲缚的方式绑住的埃菲，眼皮跳了跳，也不知道伊琳娜是从哪里学的手法……
en_us: Mag flicked a glance at Eiffie, who was tied up in the tortoise shell bondage and his eyelids twitched. He wondered where did Irina learn it from...

source: 麦格知道她多半是看到先前的状况，心中暗自庆幸自己的自控能力。
en_us: Mag knew that she probably saw what happened earlier, and was pleased with his self-control.

source: 麦格知道小家伙心里，赚更多的小钱钱一定是更重要的目的，对于小家伙小小年纪就对赚钱有着这样现实的认知，他很欣慰，至少以后不用担心她会缺钱。
en_us: Mag knew what the little fellow was thinking of. Earning money was definitely the more important goal; he was rather glad that the little fellow had such a realistic sense of money. At least he would not be worried about her being in need of money.

source: 麦格知道汉娜有管理这家工厂的天赋，又是问道：“机器运作的如何？什么时候可以开始量产了？”
en_us: Mag knew that Hannah had the talent to manage this brewery, so he then asked, "How are the machines running? When can we start mass production?"

source: 麦格稍稍松了口气，又道：“还有一个问题，如果高级文明真的存在，那他们是否会对旧日支配者负责？如果有他们的加入，那些让人头疼的家伙，或许应对起来会更容易一些。”
en_us: Mag heaved a sigh of relief and said, "1 more question. If a even more advanced civilization does exist, would they be responsible for the Great Old Ones? If they join us, it might be a little easier to handle those fellows."

source: 麦格穿行于衙门屋舍之间，巨蛇在数次俯冲都未能将他抓住后，还是开始发动了攻击。
en_us: Mag dashed in between all the government buildings. After the giant snake failed to catch him after dashing at him a couple of times, it began to launch its attacks.

source: 麦格突然想起自己好久没有关心精灵族和暗夜精灵的状况了，而且这封信上也没有表明精灵族的态度。
en_us: Mag suddenly recalled that he had not asked about the Elves and Night Elves for a long time. In addition, the letter did not state the Elves' stand.

source: 麦格站在紫纹狮鹫背上，背负着双手，静静的装了个逼。
en_us: Mag acted tough with his hands behind his back as he stood on the purple-striped griffin's back.

source: 麦格站在门口，看着他一直消失在街头，确定他能够自己回家，这才转身进了餐厅，关了招牌灯。
en_us: Mag stood by the door, and watched him disappear down the street. After ensuring that Pasa could go home on his own, he turned to enter the tavern, and switched off the light for the signboard.

source: 麦格站在门外看着，独栋的二层小楼，层高还不错，和两旁的店铺相隔了一些距离。
en_us: Mag stood at the door and looked in. It was a two-story building; it was tall enough, and it had some space between it and the shops at its side.

source: 麦格端了一碗十全大补的鸡汤放在伊琳娜面前，笑着道：“特意给你炖的，放了些生命之水，好好补补。”
en_us: Mag placed a bowl of "Ten Essence Herbal Soup" in front of Irina and smilingly said, "I brewed this specially for you. I have put in some Spring of Life. You deserved some nourishment."

source: 麦格端正坐着，看了一眼坐在高脚凳上的伊琳娜，有种被审判的感觉。
en_us: Mag sat upright and glanced at Irina, who was on the barstool. He felt as though he was interrogated.

source: 麦格端着重新做好的早餐出来，颜色鲜亮的扬州炒饭，豆浆与油条的经典搭配，一碗养胃的皮蛋瘦肉粥，以及一碗麻辣扑面的红油抄手。
en_us: Mag came out with breakfast that he made again. The brightly-colored Yangzhou fried rice, the classic pairing of soybean milk and youtiao, a bowl of stomach-nourishing congee with pork and century egg and a bowl of Sichuan spicy wontons in red oil.

source: 麦格端起粗陶的酒杯，先嗅了嗅。
en_us: Mag picked up the coarse ceramic glass and took a whiff of the wine.

source: 麦格笑容温润，语气和善，俨然一副慈父贤夫的模样。
en_us: Mag smiled gently and spoke very gently like a benevolent father.

source: 麦格笑着上前，摸了摸艾米的头，安慰道：“好了，如果你们想吃的话，父亲现在就给你们做，麻辣小龙虾、烤羊肉串、烤牛肉串、烤鱼……想吃什么，你们自己说。”
en_us: Mag smiled and went up to Amy. He stroked her head, and consoled, "Alright, if you want to eat, I'll make it for you right now. Spicy crayfish, roast mutton, roast beef kebab, grilled fish… whatever you want to eat. Name it away."

source: 麦格笑着坐回了自己的位置，拿起一根油条咬了一口，又是喝了两口豆浆，他也饿了，需要补充能量。
en_us: Mag sat down at his seat with a smile. He took a bite of the youtiao and drank two sips of soybean milk. He was also hungry and need to replenish his energy.

source: 麦格笑着打开了酒馆大门，看着门外等候开门的十几位客人，说道：“久等了，欢迎光临。”
en_us: Mag opened the tavern's door, and smilingly said to the 10-odd customers waiting outside, "Thank you for waiting. Welcome to Saipan Tavern."

source: 麦格笑着摇了摇头，继续拍手里的黄瓜。
en_us: Mag shook his head with a smile and continued to smack the cucumbers in hsi hand.

source: 麦格笑着点头：“她的命令应该在明天会送达。”
en_us: Mag nodded with a smile, "Her order should reach by tomorrow."

source: 麦格笑着点点头，他很难不赞同伊琳娜的这个说法。
en_us: Mag nodded with a smile. It was difficult to disagree with Irina.

source: 麦格笑着看着她，小家伙还真是随时随地能够找到让自己开心的事情。
en_us: Mag looked at her with a smile. This little fellow could find something to make herself happy any time.

source: 麦格笑着说道：“那好，你先根据自己的喜好继续画画吧，要是你真的感兴趣的话，晚些我会给你一份剧本，你就可以按照剧本来画一个故事了。”
en_us: Mag smilingly said, "That's great. You can continue to draw whatever you like first. If you are really interested, I will give you a script later, and you draw a story according to the script."

source: 麦格笑着道：“一千个客人吧。”
en_us: Mag replied with a smile, "Maybe 1000 customers."

source: 麦格笑着道：“有流星的话，你可以朝着流星许一个愿望，就会实现了哦。”
en_us: "If there's a meteor shower, make a wish and it will come true," Mag said with a smile.

source: 麦格笑着道：“那就对了，冰激凌店你看着经营吧，不要太累了，每个星期还是休假一天，给自己和姐妹们放个假。”
en_us: Mag smilingly said, "That's right. Pace yourself with the ice cream. Don't tire yourself out. Take one day off every week, and give yourself and the girls a break."

source: 麦格算是差不多听明白了，这客人的确是兵部官员，而且有个亲近的前辈被此次案件牵连，还是前夜被灭了门的官员之一。
en_us: Mag understood what was going on. This customer was an official from the military, and he had a close senior who was involved in this incident. He was one of the generals whose family was wiped out the night before.

source: 麦格红着眼睛一剑劈飞了兰克斯特，然后用尽全力将天都剑甩了出去。
en_us: Mag sent Rankster flying with one strike before tossing the Tian Du sword out with all his might.

source: 麦格细细回味了一会自己先前那一拍的动作，尝试着控制自己的力量和拍落的角度，再次挥刀落下。
en_us: Mag recalled his smacking move just now and tried to control his stregth and the angle of his smacking. After that, he wielded his cleaver again.

source: 麦格结束了和系统的对话，坐在书桌前发呆。
en_us: Mag ended his conversation with the System and sat by the study table, spacing out.

source: 麦格给两个小家伙倒了杯热牛奶，下酒菜和牛奶，其实也挺配的。
en_us: Mag warmed some milk for the two little fellows. The side dishes actually went quite well with milk too.

source: 麦格给两个小家伙讲了个睡前故事，等她们都睡着了，这才悄悄推出房间，关上门。
en_us: Mag told the two fellows a bedtime story, and left the room silently only after they had fallen asleep, not forgetting to close the door behind him.

source: 麦格给两人倒了两杯水，在他们对面坐下，平静的问道：“不知大主教今日来访有何事？”
en_us: Mag poured two glasses of water for them before sitting down across from them, and calmly asked, "May I know the purpose of your visit here today, Archbishop?"

source: 麦格给他再满上一杯，不过这次没有再急着和他干杯，这可不是啤酒，一杯接一杯的干，小半瓶可就没了，而且这家伙要是醉了，他还不知道怎么安排才好。
en_us: Mag filled up Pasa's glass once again. However, he did not clink glasses with him again. This was not beer. If they drank one cup after another, this leftover wine would be gone in no time, and he would not know what to do if this fellow got drunk.

source: 麦格给汉娜的朗姆酒工厂设计了全套的设备，自然能够一眼看出这套设备的缺陷。
en_us: Mag had designed the entire set of equipment for Hannah's rum brewery, so naturally he could see the defects in this set of equipment.

source: 麦格给自己也夹了一只蟹黄灌汤包，动作轻快，趁灌汤包不注意，夹住褶皱轻轻一提，然后快速放进自己的碟子里。
en_us: Mag also picked a crab roe soup dumpling for himself quickly and gently. Before the soup dumpling even noticed, it was picked up gently by its fold and was quickly placed on Mag's plate.

source: 麦格给足了提示，让一起同行竞争，黑市买凶，掳掠女老板，惊魂一天一夜的大案，得以快速告破。
en_us: Mag gave enough hints, allowing the case of buying a killer on the black market and kidnapping of the female lady boss due to business competition that shocked the city for a day and night to finally come to a close.

source: 麦格翻看了一遍，画风可爱，节奏流畅，完全能够胜任寓教于乐的功能。
en_us: Mag flipped through the book. The drawing style was cute and the story was paced well. It could achieve education and pleasure at the same time.

source: 麦格翻阅了几座院墙，来到了土楼巷尽头的那座院落外，没有直接走进土楼巷。
en_us: Mag flipped over a few courtyard walls and came to Tulou alley. He stood outside and did not walk in straightaway.

source: 麦格能够感受到露娜对这所学校投注了极大的心力和希望，相比于混乱学园勉强扩招的几百个学籍，希望学园才是能够真正解决底层孩子上学的办法。
en_us: Mag could sense that Luna had put great energy and hope into the Hope School. Compared to the Chaos School trying to expand its recruitment by a few hundred students, the Hope School was the real solution to resolve the problem of schooling for the children from the lowest rung of society.

source: 麦格能够理解她的感受，毕竟诺兰大陆上的人们应该都认为自己在世界的中心，天地都是围绕着自己转的。
en_us: Mag could understand what she was feeling. After all, the people in Norland Continent all probably think that their world is the core and the sky and earth revolved around them.

source: 麦格能够酿出不弱于泰坦酒的美酒，她的防备心也就没了。
en_us: Her guard was down as long as Mag could not brew anything better than Titan Liquor.

source: 麦格脸上也是露出了几分兴致，以泰坦酒的品质，加上三十年的窖藏酝酿，秒杀那所谓的爆炸酒自然不在话下。
en_us: There was also a hint of interest on Mag's face. With Titan Liquor's quality and 30 years age in the cellar, it would unquestionably vanquish that so-called Explosive Liquor.

source: 麦格脸上的笑容渐渐僵硬，有点心虚道：“事情其实不是你想象的这样的……”
en_us: The smile on Mag's face stiffened gradually. He said guiltily, "It's not what you think it is…"

source: 麦格脸上的肌肉抽搐了一下，这个女人过于冷漠且直接的对话方式，让他有点不太适应。
en_us: Mag's facial muscles twitched. He wasn't quite used to this woman's cold and direct way of talking.

source: 麦格自从与克苏鲁一起渡过天劫之后，已经很久没有感受到危险的存在，这一刻却在这个女人身上感受到了。
en_us: Ever since Mag passed the test together with the Cthulhu, he had never felt the presence of danger for a long time. However, he felt it on this woman right now.

source: 麦格若有所思的点点头。
en_us: Mag nodded htoughtfully.

source: 麦格若有所思，看来回去之后他要好好去找一些关于鬼族的资料看看了，对这个种族了解太少。
en_us: Mag was thoughtful. It seemed like he had to go back to find and read up on information about the Ghost Clan. He knew too little about them.

source: 麦格落到了紫纹狮鹫背上，看着下方的深坑，有点惊讶道。
en_us: Mag landed on the purple-striped griffin's back and said with surprise as he looked at the crater below.

source: 麦格表情先是一惊，想着自己今天是否还约了其他女人上门切磋。
en_us: Mag jolted first. He thought carefully about whether he said anything about exchanges to other women.

source: 麦格表情变得有些凝重，沉声道：“那些仆从现在何处？是否还活着？”
en_us: Mag turned solemn and gravely asked, "Where are those servants now? Are they still alive?"

source: 麦格表情有点僵，毕竟他刚刚才信誓旦旦的说这是可以食用的蜗牛，现在却惨遭伊琳娜否定。
en_us: Mag had an awkward expression. He had just said that this was an edible snail and now he was proven wrong by Irina.

source: 麦格表情淡然，心里却是有些惊讶，没想到才两三天的时间，竟然已经有那么多商家找上门来。
en_us: Mag might look calm but he was rather shocked inwardly. He didn't expect so many businesses to come looking for rental in just two to three days.

source: 麦格被小家伙软糯糯的话语说的心都化了，什么焦黑的炒饭、一片狼藉的厨房都通通被他抛到脑后，满口答应道：“好好好，父亲大人教你做拍黄瓜。”
en_us: Mag's heart was melted by the little fellow's adorableness. The burnt fried rice, chaotic kitchen, and more, were all thrown to the back of his head. Mag agreed, saying, "Alright, alright, I'll teach you how to make the Smashed Cucumber Salad."

source: 麦格要哭了，早知道刚刚一开门就给那妖精来一发大威天龙，收了那妖孽，也就没这么多事了。
en_us: Mag was on the brink of tears. If he'd known, he would have subdued that demon the moment he opened the door, and there would not have been so much trouble.

source: 麦格见埃菲点头，也是笑着道：“行，既然埃菲小姐同意，那一会吃了饭我测试一下你的天赋，要是合格的话，你可以跟着学做菜。”
en_us: Mag looked at Eiffie and nodded as he said with a smile, "Sure. Since Miss Eiffie is agreeable, I'll test out your talent after the meal. If you pass, You can learn from me."

source: 麦格觉得自己就是一条无辜的小鱼儿。
en_us: Mag felt as though he was an innocent blade of grass.

source: 麦格觉得这下真是越抹越黑了。
en_us: Mag felt it got worse as he tried to explain.

source: 麦格解释道：“漫画家，也就是专业画画册的画手，这些画册就是由漫画家创造出来的。”
en_us: Mag explained, "Comic artists are professional picture books' illustrators. These picture books are created by comic artists."

source: 麦格说道，已是夹起了一颗田螺放到嘴里，嘴唇含住田螺，气沉丹田，然后趁着田螺不注意，快速一嗦。
en_us: Mag put an escargot in his mouth. He held it with his lips and using his diaphragm, he sucked the meat in quickly.

source: 麦格说道：“昨夜洛都发生了几起灭门惨案，死者是和此次兽人战争有关的兵部大臣的家眷，手段残忍，而且最后也都放了火，我怀疑此事与乔修有关，他可能已经回到洛都。”
en_us: Mag said, "There were a few family murder cases last night in Rodu. The victims were all the generals related to this campaign against orcs and their families. The murder means were very cruel. In addition, the murderer set everything ablaze to end off. I suspect that this incident is related to Josh. He might have returned to Rodu."

source: 麦格走入酒窖，伸手抚摸着橡木桶，提议道：“个人建议你用这个酒窖里的酒参加本届品酒大会，然后用这一批泰坦酒替代你的酒馆里现在卖的泰坦酒，小瓶灌装，提高酒的单价，让泰坦酒馆重新步入高端酒馆的行列。”
en_us: Mag entered the cellar and reached out to touch the oak barrels. He suggested, "I personally suggest that you use the liquor in this cellar to take part in this year's liquor tasting and then use this batch of Titan Liquor to replace the Titan Liquor that you are selling in your tavern now. Put them in small bottles and increase their individual price to put Titan Tavern back into the realm of high-end of taverns."

source: 麦格起身准备去取样酒。
en_us: Mag stood up and got ready to take the wine sample.

source: 麦格蹲在不远处的树梢上，看着端坐在那房间门口的十级骑士，长剑立在他的身侧，虽然闭着眼睛，却也能够感受得到他的强大威慑力。
en_us: Mag squatted on a tree branch not far away. He watched the 10th-tier knight who was sitting upright outside the room door. He had his longsword by him, and although his eyes were closed, Mag could sense his strong powers.

source: 麦格转了一圈，失望而归。
en_us: Mag walked around before leaving with disappointment.

source: 麦格迈出去的脚步又缓缓收了回来，表情略显古怪的在门口听着，没想到从他那里拿了几本企业管理的书，汉娜厂长就当的有模有样了。
en_us: Mag retracted his steps slowly, and listened at the door with a weird expression. He didn't expect Hannah to behave exactly like a brewery director after receiving a couple of books on business management from him.

source: 麦格还没有从蛋黄酥的噩梦中回过神来，眨了眨眼睛，侧头看了一眼床头的闹钟。
en_us: Mag still hadn't recovered from the salted egg yolk pastry's nightmare. He blinked and turned to look at the alarm clock at the side of the bed.

source: 麦格还没来得及阻止，那瓶可口可乐已经被暴力掰开，可乐喷涌而出，在空中画出了一道彩虹。
en_us: Before Mag could stop her, the Coca-cola was already forcefully opened and the drink burst right out, forming an arch in the air.

source: 麦格还真不知道该怎么形容。
en_us: Mag really didn't know how to describe it.

source: 麦格这边玩的不亦乐乎，另一边坐在窗边，托着腮帮子，还在生闷气的埃菲，被一本飞来的书啪的盖在脸上，差点当场去世。
en_us: Mag was having a lot of fun here. On the other hand, Eiffie, who was propping her face on her hand and sulking by the window, was hit right in her face by a book that flew in. She almost died right on the spot.

source: 麦格连夜给伊琳娜顿了一锅大补的佛跳墙，第二天一早等她醒来后，先喝了一碗粥，便直接能够喝道刚刚炖好出锅的佛跳墙。
en_us: Mag made a big pot of nourishing Buddha jumps over the wall for Irina overnight. She could have a bowl of freshly made Buddha jumps over the wall after she woke up tomorrow and had a bowl of porridge first.

source: 麦格连忙向后再退两步。
en_us: Mag quickly took two steps back.

source: 麦格连忙把她搀起来。
en_us: Mag quickly helped her up.

source: 麦格连忙摆手：“不不不，不是这样的！”
en_us: Mag quickly waved his hands. "No, no, no, it's not like that!"

source: 麦格连忙摇头：“没有，是挺正常的，以前我也经常把切菜台剁了做菜。”
en_us: Mag quickly shook his head, "No. It's pretty normal. I used to hack the cutting table when I am cutting up the ingredients."

source: 麦格连忙起床穿好衣服，拉好被子给伊琳娜盖好，遮住她那双修长白皙的长腿，这才开门出去。
en_us: Mag quickly got up to put on his clothes. He pulled the blanket over Irina and covered her long and fair legs before he opened the door and go out.

source: 麦格连忙起身帮她拉开椅子，自然的牵过她的手，扶她坐下。
en_us: Mag quickly got up to pull the chair out for her. He held her hand naturally and helped her sit down.

source: 麦格闭上眼睛嗅了嗅，典型的甜味果酒，酒香尚可，没什么特别的感觉，也就比寻常人家自酿的果酒好一点的程度。
en_us: Mag closed his eyes and took a sniff. It was a typical sweet ratafia. It smelt alright but there was nothing special about it. It was simply slightly better than the homemade ratafia.

source: 麦格闭上眼睛，细细品味着美酒带来的愉悦体验。
en_us: Mag closed his eyes and indulged in the joyful experience of tasting the wine.

source: 麦格闻言倒也不恼，这说明福利院的规章制度贯彻的很好，工作人员和很负责。
en_us: Mag wasn't annoyed when he heard that. This meant that the orphanage's rules and regulations were firmly enforced, and the staff members were very conscientious.

source: 麦格闻言沉默了，认真思考着伊琳娜说的话，旧日支配者赋予乔修的能力是未知的，而且他的=身份也的确很特殊。
en_us: Mag turned quiet after hearing that as he considered Irina's words seriously. The power that the Great Old Ones bestowed on Josh was unknown yet, and his identity was indeed very special.

source: 麦格闻言皱眉，“这里没有神女，看来两位是找错地方了。”
en_us: Mag frowned after hearing that. "There is no holy maiden here. Seems like you guys have to come to the wrong place."

source: 麦格阔气的给他们免了一份酒鬼花生的钱。
en_us: Mag generously waived the cost of a helping of drunkard peanuts off their bill.

source: 麦格随手把那封教皇的亲笔信丢进了垃圾桶，无论那个家伙说了些什么天花乱坠的话，他都不可能把艾米送到教廷。
en_us: Mag tossed the pope's letter into the trash can casually. No matter what flowery words that fellow said, he would never send Amy to the Holy See.

source: 麦格随手翻看着书架上的画册，有一句没一句的和老板聊着，脑子里则在思考将做菜教程变成画册的可行性。
en_us: Mag flipped through the picture albums on the shelves casually as he chitchatted with the boss. He was thinking about the probability of transforming the teaching tutorials into picture albums.

source: 麦格隐匿了气息，在不远处停下看戏。
en_us: Mag concealed his aura and stopped to watch the show close by.

source: 麦格隔着小板凳和帕萨一眼在台阶上坐下，身后门完全开着，温暖的暖气从身后吹来，吹走了寒气。
en_us: Mag sat down beside Pasa on the step with the stool in between them. The door behind them was wide open, and the warm air from inside blew out, chasing away the chill.

source: 麦格非常尊重孩子们的选择，所以捧着金奖杯，一家人就径直离开了庄园，在路边准备拦一辆马车回家。
en_us: Manor respected the children's choice. Therefore, the entire family left the Manor straightaway and hailed a horse-drawn carriage by the side of the road with the trophy in their arms.

source: 麦格面色微变，意识到自己失态了，连忙正色道：“不不不，我怎么会有这种骄奢淫逸的想法呢。”
en_us: Mag went white. He realized that he had said the wrong thing, and quickly corrected himself, "No, no, no. How would I ever have such lustful and extravagant thoughts?"

source: 麦格高声道，手一扬，天都剑已是化作一道流光飞向兰克斯特，直刺他的心脏。
en_us: Mag shouted. He waved his hand and Tian Du sword transformed into a flash of light as it flew towards Rankster, striking his heart.
